{
  "APP_NAME": "Estilo",


  "MENU": {
    "TITLE": "Menu",
    "SEARCH": "Search",
    "TRANSLATE": "Translate",
    "PLAYLISTS": "Playlists",
    "LOGOUT": "Logout"
  },
  "TRANSLATE": {
    "TITLE": "Hello - JSON",
    "FOO": "This is a paragraph",
    "LANGUAGE_LABEL": "Language",
    "TITLE": "Translate"
  },
  "WELCOME": {
    "TITLE": "Welcome to Estilo",
    "BUTTON_SIGNUP": "Sign Up",
    "BUTTON_LOGIN": "Log In",
    "LOGIN_WITH_FACEBOOK": "Login with facebook",
    "LOGIN_WITH_GOOGLEPLUS": "Login with google"
  },
  "LOGIN": {
    "TITLE": "Log In",
    "FORGOT_PASSWORD": "Forgot Password?",
    "FORM_EMAIL": "Email Address",
    "FORM_PASSWORD": "Password",
    "FORM_BUTTON": "Log In",
    "FORM_INCOMPLETE": "Looks like your form is incomplete. Can you please double check and submit again?",
    "ERROR_TITLE": "Log In Error"
  },
  "FORGOTPASS": {
    "TITLE": "Forgot Password",
    "INSTRUCTIONS": "Please enter your email address and we'll send you an email to reset your password.",
    "SUCCESS": "We have sent an email to {{email}} with the instructions to reset your password.",
    "FORM_EMAIL": "Email Address",
    "FORM_BUTTON": "Reset Password"
  },
  "SIGNUP": {
    "TITLE": "Sign Up",
    "FORM_NAME": "Full Name",
    "FORM_EMAIL": "Email Address",
    "FORM_PASSWORD": "Password",
    "FORM_BUTTON": "Sign Up",
    "FORM_INCOMPLETE": "Looks like your form is incomplete. Can you please double check and submit again?",
    "LOADING": "Signing Up...",
    "ERROR_TITLE": "Sign Up Error"
  },


  "AUTHENTICATION_DISABLED": "The requested authentication provider is disabled for this Firebase application.",
  "EMAIL_TAKEN": "The new user account cannot be created because the specified email address is already in use.",
  "INVALID_ARGUMENTS": "The specified credentials are malformed or incomplete. Please refer to the error message, error details, and Firebase documentation for the required arguments for authenticating with this provider.",
  "INVALID_CONFIGURATION": "The requested authentication provider is misconfigured, and the request cannot complete. Please confirm that the provider's client ID and secret are correct in your App Dashboard and the app is properly set up on the provider's website.",
  "INVALID_CREDENTIALS": "The specified authentication credentials are invalid. This may occur when credentials are malformed or expired.",
  "INVALID_EMAIL": "The specified email is not a valid email.",
  "INVALID_ORIGIN": "A security error occurred while processing the authentication request. The web origin for the request is not in your list of approved request origins. To approve this origin, visit the Login & Auth tab in your App Dashboard.",
  "INVALID_PASSWORD": "The specified user account password is incorrect.",
  "INVALID_PROVIDER": "The requested authentication provider does not exist. Please consult the Firebase Authentication documentation for a list of supported providers.",
  "INVALID_TOKEN": "The specified authentication token is invalid. This can occur when the token is malformed, expired, or the Firebase app secret that was used to generate it has been revoked.",
  "INVALID_USER": "The specified user account does not exist.",
  "NETWORK_ERROR": "An error occurred while attempting to contact the authentication server.",
  "PROVIDER_ERROR": "A third-party provider error occurred. Please refer to the error message and error details for more information.",
  "TRANSPORT_UNAVAILABLE": "The requested login method is not available in the user's browser environment. Popups are not available in Chrome for iOS, iOS Preview Panes, or local, file:// URLs. Redirects are not available in PhoneGap / Cordova, or local, file:// URLs.",
  "UNKNOWN_ERROR": "An unknown error occurred. Please refer to the error message and error details for more information.",
  "USER_CANCELLED": "The current authentication request was cancelled by the user.",
  "USER_DENIED": "The user did not authorize the application. This error can occur when the user has cancelled an OAuth authentication request."

}
